; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared5 - mode
	image3 - mode
	infrared1 - mode
	spectrograph0 - mode
	spectrograph6 - mode
	image4 - mode
	image2 - mode
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	Star10 - direction
	GroundStation11 - direction
	Star13 - direction
	GroundStation7 - direction
	GroundStation0 - direction
	GroundStation12 - direction
	GroundStation9 - direction
	GroundStation4 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared5)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
	(supports instrument1 spectrograph6)
	(supports instrument1 spectrograph0)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 GroundStation12)
	(supports instrument2 spectrograph6)
	(supports instrument2 spectrograph0)
	(supports instrument2 image2)
	(supports instrument2 infrared1)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 GroundStation12)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(have_image Phenomenon14 image4)
	(have_image Star15 infrared5)
	(have_image Star15 image2)
	(have_image Phenomenon16 image3)
	(have_image Planet17 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite1 groundstation9 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 groundstation9)
   goals met: 0 of 5
3. (turn_to satellite0 groundstation9 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation9)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 groundstation9)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 star15 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 star15)
   goals met: 0 of 5
6. (take_image satellite0 star15 instrument0 image2)
   added: (have_image star15 image2)
   goals met: 1 of 5
7. (take_image satellite0 star15 instrument0 infrared5)
   added: (have_image star15 infrared5)
   goals met: 2 of 5
8. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 5
9. (calibrate satellite1 instrument1 groundstation9)
   added: (calibrated instrument1)
   goals met: 2 of 5
10. (turn_to satellite1 phenomenon14 groundstation9)
   deleted: (pointing satellite1 groundstation9)
   added: (pointing satellite1 phenomenon14)
   goals met: 2 of 5
11. (take_image satellite1 phenomenon14 instrument1 image4)
   added: (have_image phenomenon14 image4)
   goals met: 3 of 5
12. (turn_to satellite1 groundstation12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 groundstation12)
   goals met: 3 of 5
13. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 3 of 5
14. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 5
15. (calibrate satellite1 instrument2 groundstation12)
   added: (calibrated instrument2)
   goals met: 3 of 5
16. (turn_to satellite1 phenomenon16 groundstation12)
   deleted: (pointing satellite1 groundstation12)
   added: (pointing satellite1 phenomenon16)
   goals met: 3 of 5
17. (take_image satellite1 phenomenon16 instrument2 image3)
   added: (have_image phenomenon16 image3)
   goals met: 4 of 5
18. (turn_to satellite1 planet17 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet17)
   goals met: 4 of 5
19. (take_image satellite1 planet17 instrument2 spectrograph0)
   added: (have_image planet17 spectrograph0)
   goals met: 5 of 5
